#### `success` Terraform Format and Style
#### `success` Terraform Initialization
#### ️`success` Terraform Validation
#### `success` Terraform Plan
#### Please check the service here: http://myservice-test-187807313.us-east-2.elb.amazonaws.com

<details><summary>Show Plan</summary>

```terraform
[0m[1mmodule.webserver_cluster.aws_vpc.myservice_vpc: Refreshing state... [id=vpc-071a049bdc2aa43b3][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_b: Refreshing state... [id=subnet-028be2579a582a0ac][0m
[0m[1mmodule.webserver_cluster.aws_internet_gateway.gw: Refreshing state... [id=igw-066b3a9a4d4283838][0m
[0m[1mmodule.webserver_cluster.aws_security_group.elb: Refreshing state... [id=sg-042bd0665799e8a6c][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_c: Refreshing state... [id=subnet-06b7e68450bee03ca][0m
[0m[1mmodule.webserver_cluster.aws_subnet.myservice_a: Refreshing state... [id=subnet-0cdb8347832c5d00e][0m
[0m[1mmodule.webserver_cluster.aws_main_route_table_association.a: Refreshing state... [id=rtbassoc-021f0bd52613b5b09][0m
[0m[1mmodule.webserver_cluster.aws_route_table.r: Refreshing state... [id=rtb-0adffc5ed4e6cf550][0m
[0m[1mmodule.webserver_cluster.aws_elb.myservice: Refreshing state... [id=myservice-test][0m
[0m[1mmodule.webserver_cluster.aws_db_subnet_group.myservice: Refreshing state... [id=myservice-rds-subnet-group][0m
[0m[1mmodule.webserver_cluster.aws_route_table_association.a3: Refreshing state... [id=rtbassoc-0684bdc4543427eb5][0m
[0m[1mmodule.webserver_cluster.aws_route_table_association.a2: Refreshing state... [id=rtbassoc-03d7ae83553eb820e][0m
[0m[1mmodule.webserver_cluster.aws_route_table_association.a1: Refreshing state... [id=rtbassoc-08ccbcdcb2c675c03][0m
[0m[1mmodule.webserver_cluster.aws_db_instance.myservice-db: Refreshing state... [id=terraform-20210325195500260900000001][0m
[0m[1mmodule.webserver_cluster.aws_launch_configuration.myservice: Refreshing state... [id=myservice-test][0m
[0m[1mmodule.webserver_cluster.aws_autoscaling_group.myservice: Refreshing state... [id=myservice-test][0m

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.webserver_cluster.aws_autoscaling_group.myservice[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_autoscaling_group" "myservice" {
      [32m+[0m [0m[1m[0marn[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zones[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mdefault_cooldown[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mdesired_capacity[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mforce_delete[0m[0m              = false
      [32m+[0m [0m[1m[0mhealth_check_grace_period[0m[0m = 300
      [32m+[0m [0m[1m[0mhealth_check_type[0m[0m         = "ELB"
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mlaunch_configuration[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mload_balancers[0m[0m            = [
          [32m+[0m [0m"myservice-test",
        ]
      [32m+[0m [0m[1m[0mmax_size[0m[0m                  = 1
      [32m+[0m [0m[1m[0mmetrics_granularity[0m[0m       = "1Minute"
      [32m+[0m [0m[1m[0mmin_size[0m[0m                  = 1
      [32m+[0m [0m[1m[0mname[0m[0m                      = "myservice-test"
      [32m+[0m [0m[1m[0mprotect_from_scale_in[0m[0m     = false
      [32m+[0m [0m[1m[0mservice_linked_role_arn[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mvpc_zone_identifier[0m[0m       = [
          [32m+[0m [0m"subnet-028be2579a582a0ac",
          [32m+[0m [0m"subnet-06b7e68450bee03ca",
          [32m+[0m [0m"subnet-0cdb8347832c5d00e",
        ]
      [32m+[0m [0m[1m[0mwait_for_capacity_timeout[0m[0m = "10m"

      [32m+[0m [0mtag {
          [32m+[0m [0m[1m[0mkey[0m[0m                 = "Name"
          [32m+[0m [0m[1m[0mpropagate_at_launch[0m[0m = true
          [32m+[0m [0m[1m[0mvalue[0m[0m               = "terraform-asg-myservice-test"
        }
    }

[1m  # module.webserver_cluster.aws_launch_configuration.myservice[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_launch_configuration" "myservice" {
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m = true
      [32m+[0m [0m[1m[0mebs_optimized[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0menable_monitoring[0m[0m           = true
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mimage_id[0m[0m                    = "ami-01e7ca2ef94a0ae86"
      [32m+[0m [0m[1m[0minstance_type[0m[0m               = "t2.micro"
      [32m+[0m [0m[1m[0mkey_name[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "myservice-test"
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m             = [
          [32m+[0m [0m"sg-042bd0665799e8a6c",
        ]
      [32m+[0m [0m[1m[0muser_data[0m[0m                   = "c290bdbcdb5016123dd418eb85b833663e078002"

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [32m+[0m [0mmetadata_options {
          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)
        }

      [32m+[0m [0mroot_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @behoof4mind, Action: `pull_request`, Workflow: `Create PR Env`*